{
    "subjects": [
      {
        "subject": "Introduction to computer science",
        "subjectID": "01418114",
        "credit": 3,
        "description": "พัฒนาการของคอมพิวเตอร์ การแทนข้อมูลในคอมพิวเตอร์ ระบบจำนวน องค์ประกอบของฮาร์ดแวร์คอมพิวเตอร์ ตัววัดสมรรถนะของคอมพิวเตอร์ ซอฟต์แวร์ระบบ ตัวแปลภาษาและภาษาการโปรแกรม ความซับซ้อนในระบบคอมพิวเตอร์ การจัดองค์การของระบบคอมพิวเตอร์ สถาปัตยกรรมไคลแอนต์-เซิร์ฟเวอร์ เครือข่ายคอมพิวเตอร์ ความมั่นคงของสารสนเทศ การประยุกต์ระบบคอมพิวเตอร์ปัจจุบัน จริยธรรมทางคอมพิวเตอร์"
      },
      {
        "subject": "CalculusI",
        "subjectID": "01417111",
        "credit": 3,
        "description": "ลิมิตและความต่อเนื่อง อนุพันธ์ของฟังก์ชันและการประยุกต์ ค่าเชิงอนุพันธ์และการประยุกต์ ปริพันธ์และการประยุกต์ปริพันธ์ไม่ตรงแบบ"
      },
      {
        "subject": "Digital computer logic",
        "subjectID": "01418131",
        "credit": 3,
        "description": "การออกแบบวงจรตรรกะเบื้องต้น การแทนข้อมูลและสารสนเทศ ควบคุมโดยสัญญาณดิจิทัล การลงรหัสการแทนตัวเลข และการคำนวณ สภาปัตยกรรมคอมพิวเตอร์"
      },
      {
        "subject": "Knowledge of the land",
        "subjectID": "01999111",
        "credit": 2,
        "description": "ประวัติ เอกลักษณ์และอัตลักษณ์ของมหาวิทยาลัยเกษตรศาสตร์ ศาสตร์แห่งแผ่นดินเพื่อความกินดีอยู่ดีของชาติ การเรียนรู้คนต้นแบบ การสำนุกในความเป็นพลเมืองไทยและพลเมืองโลก การเสริมสร้างและพัฒนาทักษะในการเรียนรู้และการทำงานสู่เป้าหมายภายใต้บริบทของความสำนึกดี มุ่งมั่น สร้างสรรค์ สามัคคี"
      },
      {
        "subject": "Foundation English I",
        "subjectID": "01355111",
        "credit": 3,
        "description": "Exposure to significant structures of the English language abilities: listening, speaking, reading, and writing through language skill integration with emphasis on communicative competence at a fundamental level."
      },
      {
        "subject": "Thai Language for Communication",
        "subjectID": "01999021",
        "credit": 3,
        "description": "ภาษาไทยในการสื่อสาร ความคิดกับการใช้ภาษา ภาษากับสังคม และการพัฒนาทักษะการใช้ภาษาไทยเพื่อการสื่อสาร"
      },
      {
        "subject": "Principles of statistics",
        "subjectID": "01422111",
        "credit": 3,
        "description": "แนวความคิดเกี่ยวกับวิชาสถิติ ตัววัดตำแหน่งที่ ตัววัดค่ากลาง ตัววัดการกระจาย ตัวแปรสุ่มและการแจกแจงความน่าจะเป็นของตัวแปรสุ่ม การแจกแจงทวินาม การแจกแจงปัวชง การแจกแจงปกติ การแจกแจงตัวอย่าง สถิติ อนุมานสำหรับประชากรเดียวและสองประชากร การวิเคราะห์ข้อมูลความถี่ การวิเคราะห์ความแปรปรวนแบบทางเดียว การวิเคราะห์ การถดถอยเชิงเส้นแบบง่าย"
      }
    ]
  }